<template>
  <v-container fluid>
    <v-layout row>
      <v-flex xs12 sm6 offset-sm3 mt-12>
        <h1 id="introduction" class="display-1 primary--text">
          <div><p>โครงการที่กำลังดำเนินการ</p></div>
        </h1>
        <div>
          <p> โครงการที่ท่านได้ลงทะเบียนและกำลังอยู่ในขั้นตอนดำเนินการ ท่านสามารถส่ง แก้ไข ลบ ข้อมูลโครงการของท่านได้ตามต้องการ</p>
        </div>
      </v-flex>
    </v-layout>

    <v-layout row mt-3>
      <v-flex xs12 sm6 offset-sm3 mt-12>

         <v-container
          style="max-height: 400px"
          class="scroll-y"
          id="scroll-target"
          >
            <v-layout
              column
              align-center
              justify-center
              v-scroll:#scroll-target="onScroll"
              style="height: 1000px"
            >
              xxxx<br>xxxx<br>xxxx<br>xxxx<br>xxxx<br>xxxx<br>xxxx<br>xxxx<br>
            </v-layout>
        </v-container>

      </v-flex>   
    </v-layout>


  </v-container>
</template>

<script>
/* eslint-disable */ 
export default {
   data: () => ({
      show: false,
      projects: [
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'},
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'},
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'},
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'},
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'}
      ]
    })
}
</script>