<template>
  <v-container fluid>
    <v-layout row>
      <v-flex xs12 sm6 offset-sm3 mt-12>
        <h1 id="introduction" class="display-1 primary--text">
          <div><p>โครงการ</p></div>
        </h1>
        <div>
          <p> โครงการที่มีการเปิดรับสมัครในขณะนี้</p>
        </div>
      </v-flex>
    </v-layout>

    <v-layout row mt-3 v-for="item in projects"
          :key="item.title">
        <v-flex xs12 sm6 offset-sm3>
          <v-card>
            <div class="text-xs-center">
              <img :src="item.img" height="200">        
            </div>
            
            <v-card-title primary-title>
              <div>
                <div class="headline">{{item.title}}</div>
                <span class="grey--text">{{item.date}}</span>
              </div>
            </v-card-title>
            <v-card-actions>
              <v-btn flat><a>รายละเอียดเพิ่มเติม</a></v-btn>
              <v-spacer></v-spacer>
              <v-btn icon @click.native="item.show = !item.show">
                <v-icon>{{ item.show ? 'keyboard_arrow_down' : 'keyboard_arrow_up' }}</v-icon>
              </v-btn>
            </v-card-actions>
            <v-slide-y-transition>
              <v-card-text v-show="item.show" v-html="item.detdescription">
                {{item.detdescription}}
              </v-card-text>
            </v-slide-y-transition>
          </v-card>
        </v-flex>
    </v-layout>


  </v-container>
</template>

<script>
/* eslint-disable */ 
export default {
   data: () => ({
      show: false,
      projects: [
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'},
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'},
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'},
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'},
        {title: 'Bridge 2 Inventor Challenge 2018',
        date: 'ประจำปี 2561',
        show: false,
        img: require('../assets/png01.png'), 
        detdescription:'เพื่อส่งเสริมการเรียนการสอนในแบบ STEM  Education    และเพื่อให้การจัดทำเอกสารการนำเสนอแนวคิดของนักเรียนที่เข้าร่วมโครงการ ฯ   เป็นไปในรูปแบบ/ทิศทางเดียวกัน  โครงการสะพานสานฝันเยาวชนนักประดิษฐ์  ปีที่ 11  จึงได้กำหนดระเบียบการเข้าร่วมโครงการออกเป็น 4 ระยะ  ดังนี้<br>ระยะที่ 1. การคัดเลือก Proposal แนวคิดสิ่งประดิษฐ์  เพื่อคัดเลือกเข้าร่วมโครงการ  จำนวน 60 โครงงาน<br>ระยะที่ 2. ทีมที่ผ่านการคัดเลือก 60 ทีม  เข้าร่วมอบรมเชิงปฏิบัติการฯ–รับมอบอุปกรณ์  พร้อมเงินสนับสนุน <br>ระยะที่ 3. การคัดเลือกคลิปวีดีโอการทำงานสิ่งประดิษฐ์ 40 ทีม จาก 60 ทีม เข้าร่วมการประกวด<br>ระยะที่ 4. การเข้าร่วมการประกวดโครงงานสิ่งประดิษฐ์  ชิงทุนการศึกษาจาก บ.ไทยบริดจสโตน จำกัด'}
      ]
    })
}
</script>